content/recipe/dill-pickles.md
---
title: "Dill Pickles"
author: ["Scavello"]
date: 2022-06-01T00:00:00-07:00
categories: ["side"]
draft: false
servings: 12
prep-time: 25
cook-time: 15
ready-in: "2+ days"
source-url: "https://www.thekitchn.com/how-to-make-dill-pickles-cooking-lessons-from-the-kitchn-193350"
---

## Equipment {#equipment}

-   Chef's knife
-   Cutting board
-   2 wide-mouth pint jars with lids
-   Large pot, if canning


## Ingredients {#ingredients}

-   1 1/2 pounds Kirby or Persian cucumbers
-   4 cloves garlic, peeled and smashed
-   2 teaspoons dill seeds
-   1/2 teaspoon red pepper flakes (optional)
-   1 cup apple cider vinegar (or white vinegar)
-   1 cup water
-   1 1/2 tablespoons pickling salt or kosher salt


## Directions {#directions}

1.  Prepare the jars. If you are planning to can your pickles for long-term storage, bring a large pot of water to a boil and sterilize 2 wide-mouth pint jars and their lids. If you are planning to make refrigerator pickles, simply washing the jars and lids is fine.
2.  Prepare the cucumbers. Wash and dry the cucumbers. Trim away the blossom or stem end of the cucumber, which contains enzymes that can lead to limp pickles. Leave the cucumbers whole, cut them into spears, or slice them into coins, as desired.
3.  Add the spices to the jars. Divide the garlic, dill seed, and red pepper flakes between the pint jars: 2 smashed cloves, 1 teaspoon dill seed, and 1/4 teaspoon red pepper flakes (if using) per jar.
4.  Pack the cucumbers into the jars. Pack the cucumbers into the jars. Trim the ends if they stand more than 1/2 inch below the top of the jar. Pack them in as tightly as you can without smashing the cucumbers.
5.  Bring the pickling brine to a boil. Place the vinegar, water, and salt in a small saucepan over high heat and bring to a rolling boil. Pour the brine over the pickles, filling each jar to within 1/2-inch of the top. You may not use all the brine.
6.  Remove any air bubbles. Gently tap the jars against the counter a few times to remove all the air bubbles. Top off with more pickling brine if necessary.
7.  Tighten the lids. Place the lids over the jars and screw on the rings until tight.
8.  Optional — Process the pickles for longer storage. For longer storage, place the jars in a boiling pot of water to can them. When the water comes back to a boil, set the timer for 5 minutes and remove the jars immediately. Make sure the lids pop down; if they do not, refrigerate those pickles and eat them first.
9.  Cool and refrigerate. Let the jars cool to room temperature. If you processed the jars, they can be stored unopened at room temperature. If unprocessed, refrigerate the pickles. The pickles will improve with flavor as they age — try to wait at least 48 hours before cracking them open.
10. Storing pickles. Canned pickles will keep for at least a year on the shelf and for several weeks in the refrigerator once opened; refrigerator pickles will keep for several weeks.